IDEA Open Model
BeamDataEc2.BeamSpanLength Property
Compatible with IDEA StatiCa Beta 20.0
 beam span lengrh - theoretical support distance
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public double BeamSpanLength { get; set; }
Public Property BeamSpanLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
BeamDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace